; domain
(define (domain gripper-strips)

    (:predicates (room ?r)
                (ball ?b)
                (gripper ?g)
                (at-robby ?r)
                (at ?b ?r)
                (free ?g)
                (carry ?o ?g)
    )

    (:action move
        :parameters (?from ?to)
        :precondition (and (room ?from)(room ?to)(at-robby ?from))
        :effect (and
            (at-robby ?to)
            (not (at-robby ?from))
        )
    )
    (:action pick
        :parameters (?obj ?room ?gripper)
        :precondition (and (ball ?obj)(room ?room)(gripper ?gripper)(at ?obj ?room)(at-robby ?room)(free ?gripper))
        :effect (and
            (carry ?obj ?gripper)
            (not (at ?obj ?room))
            (not (free ?gripper))
        )
    )
    (:action drop
        :parameters (?obj ?room ?gripper)
        :precondition (and (ball ?obj)(room ?room)(gripper ?gripper)(carry ?obj ?gripper)(at-robby ?room))
        :effect (and
            (at ?obj ?room)
            (free ?gripper)
            (not (carry ?obj ?gripper))
        )
    )
)

; problem
(define (problem gripper-22)
(:domain gripper-strips)
(:objects rooma roomb room3 room4 room5 room6 left right ball1 ball2 ball3 ball4 ball5 ball6 ball7 ball8 ball9 ball10 ball11 ball12 ball13 ball14 ball15 ball16 ball17 ball18 ball19 ball20 ball21 ball22 )
(:init
(room rooma)
(room roomb)
(room room3)
(room room4)
(room room5)
(room room6)
(gripper left)
(gripper right)
(ball ball1)
(ball ball2)
(ball ball3)
(ball ball4)
(ball ball5)
(ball ball6)
(ball ball7)
(ball ball8)
(ball ball9)
(ball ball10)
(ball ball11)
(ball ball12)
(ball ball13)
(ball ball14)
(ball ball15)
(ball ball16)
(ball ball17)
(ball ball18)
(ball ball19)
(ball ball20)
(ball ball21)
(ball ball22)
(free left)
(free right)
(at ball1 rooma)
(at ball2 rooma)
(at ball3 rooma)
(at ball4 rooma)
(at ball5 rooma)
(at ball6 rooma)
(at ball7 roomb)
(at ball8 roomb)
(at ball9 room3)
(at ball10 room3)
(at ball11 room3)
(at ball12 room3)
(at ball13 room3)
(at ball14 room3)
(at ball15 room4)
(at ball16 room5)
(at ball17 room5)
(at ball18 room5)
(at ball19 room5)
(at ball20 room6)
(at ball21 room6)
(at ball22 room6)
(at-robby rooma)
)
(:goal
(and
(at ball1 rooma)
(at ball2 rooma)
(at ball3 rooma)
(at ball4 rooma)
(at ball5 rooma)
(at ball6 rooma)
(at ball7 rooma)
(at ball8 rooma)
(at ball9 rooma)
(at ball10 rooma)
(at ball11 rooma)
(at ball12 rooma)
(at ball13 rooma)
(at ball14 rooma)
(at ball15 rooma)
(at ball16 rooma)
(at ball17 rooma)
(at ball18 rooma)
(at ball19 rooma)
(at ball20 rooma)
(at ball21 rooma)
(at ball22 rooma)
)
)
)

; plan
1. (move rooma roomb)
   deleted: (at-robby rooma)
   added: (at-robby roomb)
   goals met: 6 of 22
2. (pick ball8 roomb left)
   deleted: (at ball8 roomb) (free left)
   added: (carry ball8 left)
   goals met: 6 of 22
3. (pick ball7 roomb right)
   deleted: (at ball7 roomb) (free right)
   added: (carry ball7 right)
   goals met: 6 of 22
4. (move roomb room6)
   deleted: (at-robby roomb)
   added: (at-robby room6)
   goals met: 6 of 22
5. (move room6 rooma)
   deleted: (at-robby room6)
   added: (at-robby rooma)
   goals met: 6 of 22
6. (drop ball7 rooma right)
   deleted: (carry ball7 right)
   added: (at ball7 rooma) (free right)
   goals met: 7 of 22
7. (drop ball8 rooma left)
   deleted: (carry ball8 left)
   added: (at ball8 rooma) (free left)
   goals met: 8 of 22
8. (move rooma room6)
   deleted: (at-robby rooma)
   added: (at-robby room6)
   goals met: 8 of 22
9. (pick ball22 room6 left)
   deleted: (at ball22 room6) (free left)
   added: (carry ball22 left)
   goals met: 8 of 22
10. (pick ball21 room6 right)
   deleted: (at ball21 room6) (free right)
   added: (carry ball21 right)
   goals met: 8 of 22
11. (move room6 rooma)
   deleted: (at-robby room6)
   added: (at-robby rooma)
   goals met: 8 of 22
12. (drop ball21 rooma right)
   deleted: (carry ball21 right)
   added: (at ball21 rooma) (free right)
   goals met: 9 of 22
13. (drop ball22 rooma left)
   deleted: (carry ball22 left)
   added: (at ball22 rooma) (free left)
   goals met: 10 of 22
14. (move rooma room6)
   deleted: (at-robby rooma)
   added: (at-robby room6)
   goals met: 10 of 22
15. (pick ball20 room6 left)
   deleted: (at ball20 room6) (free left)
   added: (carry ball20 left)
   goals met: 10 of 22
16. (move room6 room5)
   deleted: (at-robby room6)
   added: (at-robby room5)
   goals met: 10 of 22
17. (pick ball19 room5 right)
   deleted: (at ball19 room5) (free right)
   added: (carry ball19 right)
   goals met: 10 of 22
18. (move room5 rooma)
   deleted: (at-robby room5)
   added: (at-robby rooma)
   goals met: 10 of 22
19. (drop ball19 rooma right)
   deleted: (carry ball19 right)
   added: (at ball19 rooma) (free right)
   goals met: 11 of 22
20. (drop ball20 rooma left)
   deleted: (carry ball20 left)
   added: (at ball20 rooma) (free left)
   goals met: 12 of 22
21. (move rooma room5)
   deleted: (at-robby rooma)
   added: (at-robby room5)
   goals met: 12 of 22
22. (pick ball18 room5 left)
   deleted: (at ball18 room5) (free left)
   added: (carry ball18 left)
   goals met: 12 of 22
23. (pick ball17 room5 right)
   deleted: (at ball17 room5) (free right)
   added: (carry ball17 right)
   goals met: 12 of 22
24. (move room5 rooma)
   deleted: (at-robby room5)
   added: (at-robby rooma)
   goals met: 12 of 22
25. (drop ball17 rooma right)
   deleted: (carry ball17 right)
   added: (at ball17 rooma) (free right)
   goals met: 13 of 22
26. (drop ball18 rooma left)
   deleted: (carry ball18 left)
   added: (at ball18 rooma) (free left)
   goals met: 14 of 22
27. (move rooma room5)
   deleted: (at-robby rooma)
   added: (at-robby room5)
   goals met: 14 of 22
28. (pick ball16 room5 left)
   deleted: (at ball16 room5) (free left)
   added: (carry ball16 left)
   goals met: 14 of 22
29. (move room5 room4)
   deleted: (at-robby room5)
   added: (at-robby room4)
   goals met: 14 of 22
30. (pick ball15 room4 right)
   deleted: (at ball15 room4) (free right)
   added: (carry ball15 right)
   goals met: 14 of 22
31. (move room4 room3)
   deleted: (at-robby room4)
   added: (at-robby room3)
   goals met: 14 of 22
32. (move room3 rooma)
   deleted: (at-robby room3)
   added: (at-robby rooma)
   goals met: 14 of 22
33. (drop ball15 rooma right)
   deleted: (carry ball15 right)
   added: (at ball15 rooma) (free right)
   goals met: 15 of 22
34. (drop ball16 rooma left)
   deleted: (carry ball16 left)
   added: (at ball16 rooma) (free left)
   goals met: 16 of 22
35. (move rooma room3)
   deleted: (at-robby rooma)
   added: (at-robby room3)
   goals met: 16 of 22
36. (pick ball9 room3 left)
   deleted: (at ball9 room3) (free left)
   added: (carry ball9 left)
   goals met: 16 of 22
37. (pick ball14 room3 right)
   deleted: (at ball14 room3) (free right)
   added: (carry ball14 right)
   goals met: 16 of 22
38. (move room3 rooma)
   deleted: (at-robby room3)
   added: (at-robby rooma)
   goals met: 16 of 22
39. (drop ball14 rooma right)
   deleted: (carry ball14 right)
   added: (at ball14 rooma) (free right)
   goals met: 17 of 22
40. (drop ball9 rooma left)
   deleted: (carry ball9 left)
   added: (at ball9 rooma) (free left)
   goals met: 18 of 22
41. (move rooma room3)
   deleted: (at-robby rooma)
   added: (at-robby room3)
   goals met: 18 of 22
42. (pick ball13 room3 left)
   deleted: (at ball13 room3) (free left)
   added: (carry ball13 left)
   goals met: 18 of 22
43. (pick ball12 room3 right)
   deleted: (at ball12 room3) (free right)
   added: (carry ball12 right)
   goals met: 18 of 22
44. (move room3 rooma)
   deleted: (at-robby room3)
   added: (at-robby rooma)
   goals met: 18 of 22
45. (drop ball12 rooma right)
   deleted: (carry ball12 right)
   added: (at ball12 rooma) (free right)
   goals met: 19 of 22
46. (drop ball13 rooma left)
   deleted: (carry ball13 left)
   added: (at ball13 rooma) (free left)
   goals met: 20 of 22
47. (move rooma room3)
   deleted: (at-robby rooma)
   added: (at-robby room3)
   goals met: 20 of 22
48. (pick ball11 room3 left)
   deleted: (at ball11 room3) (free left)
   added: (carry ball11 left)
   goals met: 20 of 22
49. (pick ball10 room3 right)
   deleted: (at ball10 room3) (free right)
   added: (carry ball10 right)
   goals met: 20 of 22
50. (move room3 rooma)
   deleted: (at-robby room3)
   added: (at-robby rooma)
   goals met: 20 of 22
51. (drop ball11 rooma left)
   deleted: (carry ball11 left)
   added: (at ball11 rooma) (free left)
   goals met: 21 of 22
52. (drop ball10 rooma right)
   deleted: (carry ball10 right)
   added: (at ball10 rooma) (free right)
   goals met: 22 of 22
